app/Http/Controllers/DistributorsController.php

    public function update(DistributorUpdateRequest $request, $dist)
    {
        $distributor = Distributors::all()->where('id', $dist->id)->first();
---
select * from `distributors` where `id` = '{\"id\":3,\"name\":\"test\",\"logo\":null,\"phone\":\"test\",\"site\":\"test\",\"author_id\":1,\"created_at\":null,\"updated_at\":null}' limit 1