app/Http/Controllers/DistributorsController.php

select * from `distributors`
---
    public function index()
    {
        $Distributors = Distributors::all();

select * from `distributors`
---
    public function create()
    {
        $distributor = new Distributors();
        $Distributors = Distributors::all();

insert into `distributors` (`name`, `phone`, `site`, `author_id`, `updated_at`, `created_at`) values ('asd', '21312', 'asds', '3', '2019-11-17 17:45:34', '2019-11-17 17:45:34')
---
    public function store(DistributorStoreRequest $request)
    {
        $distributor = new Distributors($request->all());
        $distributor->save();

insert into `distributors` (`name`, `phone`, `site`, `author_id`, `updated_at`, `created_at`) values ('test12', '213', 'asdas', '4', '2019-12-02 08:05:54', '2019-12-02 08:05:54')
select * from `distributors`
---
    public function storeAjax(DistributorStoreRequest $request) {
        $distributor = new Distributors($request->all());
        $distributor->save();

        $newDistributor = new Distributors();
        $distributors = Distributors::all();

select * from `distributors`
delete from `distributors` where `id` = 11
---
    public function destroy(Request $request, $dist)
    {

        $distributor = Distributors::all()->where('id', $dist->id);
        if($distributor->count() > 0) {
            $distributor->first()->forceDelete();